#ifndef TEAM_CTR_HPP_
#define TEAM_CTR_HPP_
#include "hitsic_common.h"
#include "sc_ftm.h"
#include "image.h"
#include "team_elec.hpp"
extern float error_n;//偏差值，定义为全局变量，为了在菜单显示
extern bool delay_runcar;//延迟发车标志位
extern int32_t mot_left ;
extern int32_t mot_right;
extern float M_right_drs;
extern float M_right_pwm;
typedef struct _cardata{
    int32_t Motorspeed[3]= {22,0,150};
    float servo_mid=7.55;            //定义舵机中值
    float servo_pwm=7.55;            //定义舵机pwm值
    float Kp = 0.019;                //定义舵机比例系数
    float Kd = 0.012;                //定义舵机微分系数
    float M_Kp = 0.020;              //定义电机比例系数
    float M_Ki = 0.010;              //定义电机积分系数
    int foresight = 100;//定义前瞻，摄像头以多远为标准
}cardata;

extern cardata c_data[2];//车数据数组
/**********************************************************************************************************************
*  @brief      电机控制函数在定时器中断中运行
*  @return     void 匀速控制舵机
*  @since      v1.1
*  Sample usage:                 Motor_ctr;
**********************************************************************************************************************/
void Motor_ctr(void);//电机控制，暂时匀速
/**********************************************************************************************************************
*  @brief      舵机初始化
*  @return     void 电磁或摄像头控制舵机
*  @since      v1.1
*  Sample usage:                 servo_init;
**********************************************************************************************************************/
void servo_init(float *pwm);
/**********************************************************************************************************************
*  @brief      pid控制函数在跑车函数主函数中运行
*  @return     void 舵机偏差
*  @since      v1.1
*  Sample usage:                 servo_pid();
**********************************************************************************************************************/
void servo_pid(void);
/**********************************************************************************************************************
*  @brief      pid控制函数在舵机中断中运行
*  @return     void 舵机pwm值
*  @since      v1.1
*  Sample usage:                 servo;
**********************************************************************************************************************/
void servo(void);
/**********************************************************************************************************************
*  @brief      电机pid控制函数
*  @return     void 电机占空比
*  @since      v1.1
*  Sample usage:                 Motor_pid();
**********************************************************************************************************************/
void Motorsp_Init(void);
/**********************************************************************************************************************
*  @brief      电机理想速度初始化函数
*  @return     void 电机理想速度
*  @since      v1.1
*  Sample usage:                 Motorsp_Init();
**********************************************************************************************************************/
void Motor_pid(void);

#endif
